app/views/books/_index.html.erb

             <i class="fas fa-heart like-btn" style="color: red">
               <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

               <i class="fas fa-heart like-btn" >
                 <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

        <td>
          <p>コメント数：<%= book.book_comments.count %></p>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]