app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2021-07-25 07:54:23.564043"], ["updated_at", "2021-07-25 07:54:23.564043"]]
---
  def follow(other_user)
    unless self == other_user
      relationships.create(followed_id: other_user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def unfollow(other_user)
    relationships.find_by(followed_id: other_user.id).destroy